PKS1C/src/DataProcessors/АРМСпециалиста/АРМСпециалиста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АРМСпециалиста</name>
</mdclass:DataProcessor>

PKS1C/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <enumValues>
    <name>Открыта</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДействийКлиента</name>
  </enumValues>
</mdclass:Enum>

PKS1C/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <comment>Дата рождения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <comment>Пол</comment>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Уточнение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКонтактноеЛицо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

PKS1C/src/Catalogs/Клиенты/Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактныеЛица</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

PKS1C/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛицаПартнеров</name>
  <basedOn>Catalog.Партнеры</basedOn>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>ДатаРегистрацииСвязи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрекращенияСвязи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПоВизитке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиКонтактногоЛица</name>
    <attributes>
      <name>РольКонтактногоЛица</name>
      <type>
        <types>CatalogRef.РолиКонтактныхЛицПартнеров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

PKS1C/src/DataProcessors/АРМСпециалиста/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ЗаявкиПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ЗаявкиПриАктивизацииСтрокиНаСервере(ТекущиеДанные);
	//ЗаблокироватьЭлементы(Элементы.ГруппаПраво);
	ЗаблокироватьПоляЗаявки();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаявкаЗакрыта(Заявка)
	Возврат Заявка.Статус = Перечисления.СтатусыЗаявок.Закрыта Или Заявка.Статус = Перечисления.СтатусыЗаявок.Отменена; 
КонецФункции

&НаСервереБезКонтекста
Функция ЗаявкаЧужая(Заявка)
	Возврат ЗначениеЗаполнено(Заявка.ОтветственноеЛицо) И Заявка.ОтветственноеЛицо <> Пользователи.АвторизованныйПользователь().ФизическоеЛицо; 
КонецФункции

&НаСервереБезКонтекста
Функция РазрешеноРедактированиеЗакрытыхЗаявок()
	Возврат УправлениеДоступом.ЕстьРоль("асРедактированиеЗакрытыхЗаявок");
КонецФункции

&НаСервереБезКонтекста
Функция РазрешеноРедактированиеЧужихЗаявок()
	Возврат УправлениеДоступом.ЕстьРоль("асРедактированиеЧужихЗаявок");
КонецФункции

&НаКлиенте
Процедура ЗаблокироватьПоляЗаявки()
	Элементы.ЗаявкиНомер1.Доступность = Ложь;
	Элементы.ЗаявкиДатаОткрытия1.Доступность = Ложь;
	Элементы.ЗаявкиДатаЗакрытия1.Доступность = Ложь;
	Элементы.ЗаявкиПлановаяДатаРешения1.Доступность = Ложь;
	Элементы.ЗаявкиСтатус1.Доступность = Ложь;
	Элементы.ЗаявкиТемаЗаявки1.Доступность = Ложь;
	Элементы.ЗаявкиТипЗаявки1.Доступность = Ложь;
	Элементы.ЗаявкиКлиент1.Доступность = Ложь;
	Элементы.ЗаявкиКонтактноеЛицо1.Доступность = Ложь;
	Элементы.ЗаявкиОтветственноеЛицо1.Доступность = Ложь;
	Элементы.ЗаявкиКонтактныйТелефон1.Доступность = Ложь;
	Элементы.ЗаявкиПочта1.Доступность = Ложь;
	Элементы.ЗаявкиПриоритет1.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РазблокироватьПоляЗаявки()
	//Элементы.ЗаявкиНомер1.ТолькоПросмотр = Ложь;
	//Элементы.ЗаявкиДатаОткрытия.ТолькоПросмотр = Ложь;
	//Элементы.ЗаявкиДатаЗакрытия.ТолькоПросмотр = Ложь;
	Элементы.ЗаявкиПлановаяДатаРешения1.Доступность = Истина;
	Элементы.ЗаявкиСтатус1.Доступность = Истина;
	Элементы.ЗаявкиТемаЗаявки1.Доступность = Истина;
	Элементы.ЗаявкиТипЗаявки1.Доступность = Истина;
	Элементы.ЗаявкиКлиент1.Доступность = Истина;
	Элементы.ЗаявкиКонтактноеЛицо1.Доступность = Истина;
	Элементы.ЗаявкиОтветственноеЛицо1.Доступность = Истина;
	Элементы.ЗаявкиКонтактныйТелефон1.Доступность = Истина;
	Элементы.ЗаявкиПочта1.Доступность = Истина;
	Элементы.ЗаявкиПриоритет1.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьЭлементы(ЭлементГруппа)
	Для Каждого Элемент Из ЭлементГруппа.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ГруппаФормы") Тогда
			Элемент.ТолькоПросмотр = Истина;
		Иначе			
			Продолжить;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЗаявку(Команда)
	Если ЗаявкаЗакрыта(Заявка) И Не РазрешеноРедактированиеЗакрытыхЗаявок() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заявка закрыта!");
		Возврат;
	КонецЕсли;
	Если ЗаявкаЧужая(Заявка) И Не РазрешеноРедактированиеЧужихЗаявок() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Запрещено изменять чужие заявки!");
		Возврат;
	КонецЕсли;
	РазблокироватьПоляЗаявки();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзмененияЗаявки(Команда)
	Если Не ЕстьПравоНаЗапись() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Запрещено изменять чужие заявки!");
		Возврат;
	КонецЕсли;
	Если Не ПроверитьНаличиеКонтактногоЛицаКлиента(ЗаявкаКлиент,ЗаявкаКонтактноеЛицо) Тогда
		Ответ = Вопрос("Указанного контактное лицо не соответствует клиенту. Создать соответствие?",РежимДиалогаВопрос.ДаНетОтмена,,,"Контакт не соответствует клиенту");
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ДобавлениеКонтактногоЛицаКлиента(ЗаявкаКлиент,ЗаявкаКонтактноеЛицо);
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;			
		КонецЕсли;
	КонецЕсли;
	Если Не ПроверитьНаличиеКонтактовКонтактногоЛицаКлиента(ЗаявкаКонтактноеЛицо,ЗначениеЗаполнено(ЗаявкаТелефон),ЗначениеЗаполнено(ЗаявкаПочта)) Тогда
		Сообщить("У указанного контактного лица в карточке есть недостающие контакты");
	КонецЕсли;
	
	Дата = ТекущаяДата();
	Если ЗаявкаСтатус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Закрыта") Или ЗаявкаСтатус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Отменена")Тогда
		Ответ = Вопрос("Внимание! После проведения заявка будет закрыта! Вы уверены?", РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
//	Если Параметры.Ключ.Пустая() Тогда
//		Объект.ДатаОткрытия = Дата; 
//	КонецЕсли;
	//ЗаявкаДата = Дата;
	
	ЗаписатьЗаявку();
	
	
	
	
	
	
	
	ТекущийОбъект.ТекстЗаявки = Новый ХранилищеЗначения(ТекстЗаявки);
	ТекущийОбъект.Решение = Новый ХранилищеЗначения(Решение);
	ТекущийОбъект.Комментарий = Новый ХранилищеЗначения(Комментарий);
КонецПроцедуры

// Записывает заявку
&НаСервере
Процедура ЗаписатьЗаявку()
	ЗаявкаОб = Заявка.ПолучитьОбъект();
	
	ЗаявкаОб.Статус = ЗаявкаСтатус;
	ЗаявкаОб.ТемаЗаявки = ЗаявкаТема;
	ЗаявкаОб.Клиент = ЗаявкаКлиент;
	ЗаявкаОб.ТипЗаявки = ЗаявкаТип;
	ЗаявкаОб.КонтактноеЛицо = ЗаявкаКонтактноеЛицо;
	ЗаявкаОб.ОтветственноеЛицо = ЗаявкаИсполнитель;
	ЗаявкаОб.КонтактныйТелефон = ЗаявкаТелефон;
	ЗаявкаОб.Почта = ЗаявкаПочта;
	ЗаявкаОб.Приоритет = ЗаявкаПриоритет;
	ЗаявкаОб.ПлановаяДатаРешения = ЗаявкаПлановаяДатаРешения;
	ЗаявкаОб.ТекстЗаявки = Новый ХранилищеЗначения(ТекстЗаявки);
	ЗаявкаОб.Комментарий = Новый ХранилищеЗначения(КомментарийЗаявки); 
	
	ЗаявкаОб.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИзмененияЗаявки(Команда)
	ТекущиеДанные = Элементы.Заявки.ТекущиеДанные;
	ЗаполнитьРеквизитыЗаявки(ТекущиеДанные);
	ЗаблокироватьПоляЗаявки();
КонецПроцедуры

&НаКлиенте
Процедура РазблокироватьЭлементы(ЭлементГруппа)
	Для Каждого Элемент Из ЭлементГруппа.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ГруппаФормы") Тогда
			Элемент.ТолькоПросмотр = Ложь;
			Элемент.Доступность = Истина;
			РазблокироватьЭлементы(Элемент);
		Иначе			
			Продолжить;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаявкиПриАктивизацииСтрокиНаСервере(ТекущиеДанные)
	ЗаполнитьРеквизитыЗаявки(ТекущиеДанные);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыЗаявки(ТекущиеДанные)
	Заявка = ТекущиеДанные.Ссылка;
	ЗаявкаНомер = Заявка.Номер;
	ЗаявкаДатаОткрытия = Заявка.ДатаОткрытия;
	ЗаявкаДатаЗакрытия = Заявка.ДатаЗакрытия;
	ЗаявкаПлановаяДатаРешения = Заявка.ПлановаяДатаРешения;
	ЗаявкаСтатус = Заявка.Статус;
	ЗаявкаТема = Заявка.ТемаЗаявки;
	ЗаявкаТип = Заявка.ТипЗаявки;
	ЗаявкаКлиент = Заявка.Клиент;
	ЗаявкаКонтактноеЛицо = Заявка.КонтактноеЛицо;
	ЗаявкаИсполнитель = Заявка.ОтветственноеЛицо;
	ЗаявкаТелефон = Заявка.КонтактныйТелефон;
	ЗаявкаПочта = Заявка.Почта;
	ЗаявкаПриоритет = Заявка.Приоритет;
		
	ТекстЗаявки = Заявка.ТекстЗаявки.Получить();
	КомментарийЗаявки = Заявка.Комментарий.Получить();
КонецПроцедуры

&НаСервере
Функция ЕстьПравоНаЗапись()
	СтарыйИсполнитель = Заявка.ОтветственноеЛицо;
	Если Не УправлениеДоступом.ЕстьРоль("асРедактированиеЧужихЗаявок")
	   И (Не (СтарыйИсполнитель = Справочники.ФизическиеЛица.ПустаяСсылка() ИЛИ СтарыйИсполнитель = Пользователи.АвторизованныйПользователь().ФизическоеЛицо)
	   ИЛИ Не (Объект.ОтветственноеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() ИЛИ Объект.ОтветственноеЛицо = Пользователи.АвторизованныйПользователь().ФизическоеЛицо)) Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьНаличиеКонтактногоЛицаКлиента(Клиент,КонтактноеЛицо)
	Если Не ЗначениеЗаполнено(КонтактноеЛицо) Или Не ЗначениеЗаполнено(Клиент) Тогда
		Возврат Истина;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КлиентыКонтактныеЛица.КонтактноеЛицо
		|ИЗ
		|	Справочник.Клиенты.КонтактныеЛица КАК КлиентыКонтактныеЛица
		|ГДЕ
		|	КлиентыКонтактныеЛица.Ссылка = &Клиент
		|	И КлиентыКонтактныеЛица.КонтактноеЛицо = &КонтактноеЛицо";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("КонтактноеЛицо",КонтактноеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если НЕ ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавлениеКонтактногоЛицаКлиента(Клиент,КонтактноеЛицо)
	АутсорсРаботы.ДобавлениеКонтактногоЛицаКлиента(Клиент,КонтактноеЛицо);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьНаличиеКонтактовКонтактногоЛицаКлиента(КонтактноеЛицо,ТелефонУказан=Ложь,ЭлектроннаяПочтаУказана=Ложь)
	Если Не ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		Возврат Истина;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Вид
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
		|ГДЕ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", КонтактноеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ТелефонКУказанию = Истина;
	ПочтаКУказанию = Истина;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И ВыборкаДетальныеЗаписи.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица Тогда
			ТелефонКУказанию = Ложь;
		ИначеЕсли ВыборкаДетальныеЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И ВыборкаДетальныеЗаписи.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица Тогда
			ПочтаКУказанию = Ложь;
		КонецЕсли
	КонецЦикла;
	ТелефонКУказанию = ТелефонКУказанию И ТелефонУказан;
	ПочтаКУказанию = ПочтаКУказанию И ЭлектроннаяПочтаУказана;
	Возврат НЕ (ТелефонКУказанию ИЛИ ПочтаКУказанию);
КонецФункции
